// 机器人取名池,玩家不可取这些名字
robotNamePool = [
  '雨中的彩虹',
  '掩藏~小情绪',
  '听一首歌、流一夜泪',
  'B1ack',
  '清酒孤灯',
  '一身王八气',
  '勒死贱人可好',
  '当Dog遇到God',
  '追影￥神兽',
  '面',
  '两面人',
  '下壹沾灬天堂',
  '爷单身却潇洒',
  '全世界最重要的就是你',
  '寂寞如花',
  '你心若移动我怎能联通',
  '送葬归来',
  '念得寝食难安',
  '哎哟°我操',
  '奥妙权志龙洗衣机',
  '#青蛙公主',
  '孤君傲',
  '念旧是一种病',
  '繁花待落尽',
  '弔zんа迗的仟總',
  '此时彼刻',
  '那、女-Ren',
  '最甜丶甜不过油嘴滑舌',
  '你伤过大爷何曾爱过大爷',
  '姐就是如此奇特',
  '啊你',
  '跟太阳说晚安',
  '癫狂小青年',
  '迩璇大爺哟',
  '有奶便是娘',
  '半夏微凉',
  '我要回幼儿园当学霸',
  '夜知冷暖',
  '斧斩苍穹',
  '枪枪稳中姑娘心',
  '无所谓的爱',
  '花飛花落、听我說愛伱',
  '看似淑女卻不溫柔',
  '恍若隔世',
  '抵住引诱',
  '站直了别趴下',
  '2B範er的小青年',
  '勿忘名',
  '深知你爱的人不是我',
  '藍天白雲耍流氓',
];

function randomName() {
  const index = Math.floor(Math.random() * (robotNamePool.length));
  return robotNamePool[index];
}

// 机器人
class Robot {
  name = randomName();
  userId = -1;
  deep = 2; // 机器人思考深度
}

module.exports = Robot;